examples/EmberPaperCases/FenceHeight/6ft/ba_NoFenceYesHouse_16H/a_windSim/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | 
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/



// choice of variables
fields  (U p k epsilon);


// Sampling and I/O settings
interpolationScheme cellPoint;
setFormat   raw;
setConfig
{
    // old Segerson case used uniform, midPoint, and midPointAndFace. When I used those, OpenFOAM 8 complained saying to use
    // lineUniform instead of uniform, lineCell instead of midPoint, and lineCellFace instead of midPointAndFace
    // axis seems to select the tilt from the origin. Using distance for axis seems better than trying to get it right
    // for each and every case
    // files seem to always be named xy, but that is probably because x and y are set, and z varies.
    type    lineUniform;    //lineCell; lineUniform; // lineCell, lineCellFace
    axis    distance;   // x, y, z, xyz, distance
    nPoints 1000;       //100;
}


type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

sets
(
    line0x205y  // this is ft, in m this is (0, 62.4840, 0 to 43.8912) (z is 210 ft)
    {
        $setConfig;
        start (  0.0000 62.4840  0.0000);
        end   (  0.0000 62.4840 64.0080);
    }
    line30x205y  // this is ft, in m this is (9.144, 62.4840, 0 to 43.8912) (z is 210 ft)
    {
        $setConfig;
        start (  9.1440 62.4840  0.0000);
        end   (  9.1440 62.4840 64.0080);
    }
    line100x205y  // this is ft, in m this is (30.48, 62.4840, 0 to 43.8912) (z is 210 ft)
    {
        $setConfig;
        start ( 30.4800 62.4840  0.0000);
        end   ( 30.4800 62.4840 64.0080);
    }
    line200x205y  // this is ft, in m this is (60.96, 62.4840, 0 to 43.8912) (z is 210 ft)
    {
        $setConfig;
        start ( 60.9600 62.4840  0.0000);
        end   ( 60.9600 62.4840 64.0080);
    }
    line300x205y  // this is ft, in m this is (91.44, 62.4840, 0 to 43.8912) (z is 210 ft)
    {
        $setConfig;
        start ( 91.4400 62.4840  0.0000);
        end   ( 91.4400 62.4840 64.0080);
    }
    line400x205y  // this is ft, in m this is (121.92, 62.4840, 0 to 43.8912) (z is 210 ft)
    {
        $setConfig;
        start (121.9200 62.4840  0.0000);
        end   (121.9200 62.4840 64.0080);
    }line500x205y  // this is ft, in m this is (152.40, 62.4840, 0 to 43.8912) (z is 210 ft)
    {
        $setConfig;
        start (152.4000 62.4840  0.0000);
        end   (152.4000 62.4840 64.0080);
    }
    line530x205y  // this is ft, in m this is (161.5440, 62.4840, 0 to 43.8912) (z is 210 ft)
    {
        $setConfig;
        start (161.5440 62.4840  0.0000);
        end   (161.5440 62.4840 64.0080);
    }
);

// ************************************************************************* //
