examples/EmberPaperCases/FenceHeight/6ft/ba_NoFenceYesHouse_16H/a_windSim/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cube.stl
{

	extractionMethod     extractFromSurface;

	extractFromSurfaceCoeffs
	{
    	includedAngle    150;
    	//geometricTestOnly no;
	}

	subsetFeatures
	{
    	nonManifoldEdges yes;
    	openEdges        yes;
	}

	//trimFeatures
	//{
    //	minElem          0;
    //	minLen           0;
	//}

	writeObj             yes;

}

// ************************************************************************* //
